logs/AWS/oltp_update_non_index.log
sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           1065
        other:                           68254
        total:                           69319
    transactions:                        69319  (6929.09 per sec.)
    queries:                             69319  (6929.09 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0022s
    total number of events:              69319

Latency (ms):
         min:                                  0.70
         avg:                                  1.15
         max:                                207.73
         95th percentile:                      1.37
         sum:                              79883.35

Threads fairness:
    events (avg/stddev):           8664.8750/99.01
    execution time (avg/stddev):   9.9854/0.00

sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           1965
        other:                           99132
        total:                           101097
    transactions:                        101097 (10103.62 per sec.)
    queries:                             101097 (10103.62 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0042s
    total number of events:              101097

Latency (ms):
         min:                                  0.71
         avg:                                  1.58
         max:                                 47.84
         95th percentile:                      1.86
         sum:                             159878.28

Threads fairness:
    events (avg/stddev):           6318.5625/39.36
    execution time (avg/stddev):   9.9924/0.00

sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           2698
        other:                           117134
        total:                           119832
    transactions:                        119832 (11947.89 per sec.)
    queries:                             119832 (11947.89 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0277s
    total number of events:              119832

Latency (ms):
         min:                                  0.72
         avg:                                  2.67
         max:                                126.62
         95th percentile:                      2.48
         sum:                             319999.71

Threads fairness:
    events (avg/stddev):           3744.7500/105.52
    execution time (avg/stddev):   10.0000/0.01

sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           2917
        other:                           116345
        total:                           119262
    transactions:                        119262 (11878.00 per sec.)
    queries:                             119262 (11878.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0387s
    total number of events:              119262

Latency (ms):
         min:                                  0.73
         avg:                                  5.37
         max:                                252.26
         95th percentile:                      2.81
         sum:                             640926.26

Threads fairness:
    events (avg/stddev):           1863.4688/192.45
    execution time (avg/stddev):   10.0145/0.01

sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 128
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           4189
        other:                           160962
        total:                           165151
    transactions:                        165151 (16460.42 per sec.)
    queries:                             165151 (16460.42 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0315s
    total number of events:              165151

Latency (ms):
         min:                                  1.03
         avg:                                  7.76
         max:                                224.77
         95th percentile:                     23.95
         sum:                            1281526.77

Threads fairness:
    events (avg/stddev):           1290.2422/78.71
    execution time (avg/stddev):   10.0119/0.01

sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 256
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           2045
        other:                           167322
        total:                           169367
    transactions:                        169367 (16824.38 per sec.)
    queries:                             169367 (16824.38 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0648s
    total number of events:              169367

Latency (ms):
         min:                                  1.10
         avg:                                 15.15
         max:                                228.43
         95th percentile:                     31.37
         sum:                            2565722.67

Threads fairness:
    events (avg/stddev):           661.5898/19.17
    execution time (avg/stddev):   10.0224/0.02

sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 512
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           1517
        other:                           152670
        total:                           154187
    transactions:                        154187 (15231.53 per sec.)
    queries:                             154187 (15231.53 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.1208s
    total number of events:              154187

Latency (ms):
         min:                                  3.57
         avg:                                 33.36
         max:                                242.58
         95th percentile:                     61.08
         sum:                            5143985.40

Threads fairness:
    events (avg/stddev):           301.1465/8.60
    execution time (avg/stddev):   10.0468/0.03